app/Http/Controllers/Api/AuthController.php

    public function login(Request $request)
    {
        $request->validate([
            'phone_number' => 'required|string',
            'password'     => 'required|string',
        ]);

        $user = Customer::where('phone_number', $request->phone_number)->first();

        if (!$user || !Hash::check($request->password, $user->password)) {
            return response()->json([
                'success' => false,
                'message' => 'Invalid phone number or password',
            ], 401);
        }

        // Load relations safely
        $user->load(['customerGroup', 'discountPlans']);
---
select * from `customers` where `phone_number` = '01688052519' limit 1
select * from `customer_groups` where `customer_groups`.`id` in (1)
select `discount_plans`.*, `discount_plan_customers`.`customer_id` as `pivot_customer_id`, `discount_plan_customers`.`discount_plan_id` as `pivot_discount_plan_id` from `discount_plans` inner join `discount_plan_customers` on `discount_plans`.`id` = `discount_plan_customers`.`discount_plan_id` where `discount_plan_customers`.`customer_id` in (372)

    public function profile(Request $request)
    {
        $user = $request->user();
        $rewardTiers = RewardPointTier::all();
---
select * from `reward_point_tiers`

    public function forgetPassword(Request $request)
    {
        $request->validate([
            'mobile' => 'required|string',
        ]);

        try {
            $customer = Customer::where('phone_number', $request->input('mobile'))->latest()->first();


            if (!$customer) {
                return response()->json([
                    'success' => false,
                    'message' => 'Customer Data Not Found'
                ], 404);
            }

            if (empty($customer->email)) {
                return response()->json([
                    'success' => false,
                    'message' => 'No email found for this customer'
                ], 400);
            }

            $token = mt_rand(100000, 999999);
            $email = $customer->email;

            DB::table('password_resets')->updateOrInsert(
                ['email' => $email],
                [
                    'token' => $token,
                    'created_at' => Carbon::now(),
                ]
            );
---
select * from `customers` where `phone_number` = '01688052519' order by `created_at` desc limit 1
update `password_resets` set `token` = 737996, `created_at` = '2025-11-21 16:36:55' where (`email` = 'fahim.tayebee@gmail.com') limit 1