app/Http/Controllers/Api/CategoryController.php

select `id`, `name`, `slug`, `image`, `parent_id` from `categories` where `is_active` = 1 and `parent_id` is null order by `name` asc
select `id`, `name`, `slug`, `image`, `parent_id`, (select count(*) from `products` where `categories`.`id` = `products`.`category_id`) as `product_count` from `categories` where `categories`.`parent_id` in (220, 221, 222, 223, 224, 225, 226, 227, 228, 229, 230, 231, 232) and `is_active` = 1
---
    public function index()
    {
        $categories = Cache::remember('categories_with_children', 3600, function () {
            $parents = Category::where('is_active', 1)
                ->whereNull('parent_id')
                ->select('id', 'name', 'slug', 'image', 'parent_id')
                ->orderBy('name')
                ->get();

            $parents->load(['children' => function ($query) {
                $query->where('is_active', 1)
                    ->select('id', 'name', 'slug', 'image', 'parent_id')
                    ->withCount('product');
            }]);

            $parents->map(function ($parent) {
                $parent->total_products = $parent->children->sum('product_count');
                return $parent;
            });

select `id`, `name`, `slug`, `image`, `parent_id` from `categories` where `slug` = 'dental-care' limit 1
---
    public function show(Request $request, $cat_slug)
    {
        $category = Category::select('id', 'name', 'slug', 'image', 'parent_id')
            ->where('slug', $cat_slug)
            ->with('children:id,parent_id') // only IDs
            ->first();