app/Http/Controllers/Api/ProductController.php

select `id`, `title` from `brands` where `brands`.`id` in (2, 4, 6, 7, 8, 9, 10, 13)
select * from `categories` where `categories`.`id` in (1, 2, 5, 16, 20, 120, 138)
select `id`, `name`, `slug`, `category_id`, `brand_id`, `price`, `image`, `promotion_price`, `qty` from `products` where `featured` = 1 and `qty` > 0 order by `created_at` desc limit 10
select `id`, `title` from `brands` where `brands`.`id` in (4, 21, 26, 111, 234, 244, 321)
---
    public function featured()
    {
        $products = cache()->remember('featured_products', 3600, function () {
            return Product::select('id', 'name', 'slug', 'category_id', 'brand_id', 'price', 'image', 'promotion_price', 'qty')
                ->where('featured', true)
                ->where('qty', '>', 0)
                ->orderBy('created_at', 'desc')
                ->with([
                    'brand:id,title',
                    'category',
                    'category.parent',
                    'unit'
                ])
                ->take(10)
                ->get();
        });

select * from `categories` where `categories`.`id` in (1, 43, 48, 81)
select * from `units` where `units`.`id` in (1)
select `id`, `title` from `brands` where `brands`.`id` in (2, 4, 12, 21, 26, 41, 55, 64)
select `products`.`id`, `products`.`name`, `products`.`slug`, `products`.`category_id`, `products`.`brand_id`, `products`.`price`, `products`.`image`, `products`.`promotion_price`, products.*, SUM(product_sales.qty) as total_sold from `products` inner join `product_sales` on `products`.`id` = `product_sales`.`product_id` where `products`.`qty` > 0 group by `products`.`id` order by `total_sold` desc limit 10
---
    public function bestSelling(){
        $products = cache()->remember('best_selling_products', 3600, function () {
            return \App\Models\Product::select('products.id', 'products.name', 'products.slug', 'products.category_id', 'products.brand_id', 'products.price', 'products.image', 'products.promotion_price')
                ->with(['brand:id,title', 'category', 'category.parent', 'unit'])
                ->join('product_sales', 'products.id', '=', 'product_sales.product_id')
                ->selectRaw('products.*, SUM(product_sales.qty) as total_sold')
                ->where('products.qty', '>', 0) // product stock available
                ->groupBy('products.id')
                ->orderByDesc('total_sold')
                ->take(10) // top 10 best-selling
                ->get();