app/Http/Controllers/CustomerController.php

select * from `roles` where `roles`.`id` = 1 limit 1
select `permissions`.*, `role_has_permissions`.`role_id` as `pivot_role_id`, `role_has_permissions`.`permission_id` as `pivot_permission_id` from `permissions` inner join `role_has_permissions` on `permissions`.`id` = `role_has_permissions`.`permission_id` where `role_has_permissions`.`role_id` = 1
select `name` from `custom_fields` where (`belongs_to` = 'customer' and `is_table` = 1)
---
    public function index()
    {
        $role = Role::find(Auth::user()->role_id);
        if ($role->hasPermissionTo('customers-index')) {
            $permissions = Role::findByName($role->name)->permissions;
            foreach ($permissions as $permission)
                $all_permission[] = $permission->name;
            if (empty($all_permission))
                $all_permission[] = 'dummy text';
            $custom_fields = CustomField::where([
                ['belongs_to', 'customer'],
                ['is_table', true]
            ])->pluck('name');

select count(*) as aggregate from `customers` where `is_active` = 1
select * from `customers` where `is_active` = 1 order by `created_at` desc limit 10 offset 0
---
    public function customerData(Request $request)
    {
        $q = Customer::where('is_active', true);
        $totalData = $q->count();
        $totalFiltered = $totalData;

        $limit = $request->input('length') != -1 ? $request->input('length') : $totalData;
        $start = $request->input('start');
        $order = 'created_at';
        $dir = $request->input('order.0.dir', 'desc');

        $q = $q->offset($start)
            ->limit($limit)
            ->orderBy($order, $dir);

        if (!empty($request->input('search.value'))) {
            $search = $request->input('search.value');
            $q->where(function ($query) use ($search) {
                $query->where('name', 'LIKE', "%{$search}%")
                    ->orWhere('company_name', 'LIKE', "%{$search}%")
                    ->orWhere('phone_number', 'LIKE', "%{$search}%");
            });
        }

        $customers = $q->get();

select * from `reward_point_tiers` where `min_points` <= 197 and `max_points` >= 197 limit 1
---
            // reward tier lookup
            $tier = null;
            if ($customer->points !== null) {
                $tier = RewardPointTier::where('min_points', '<=', $customer->points)
                    ->where('max_points', '>=', $customer->points)
                    ->first();

select sum(`returns`.`grand_total`) as aggregate from `sales` inner join `returns` on `sales`.`id` = `returns`.`sale_id` where (`sales`.`customer_id` = 372 and `sales`.`payment_status` != 4)
select SUM(grand_total) as grand_total,SUM(paid_amount) as paid_amount from `sales` where (`customer_id` = 372 and `payment_status` != 4) limit 1
select * from `account_removal_requests` where `user_id` = 372 order by `created_at` desc limit 1
---
            $nestedData['reward_tier'] = $tier ? $tier->name : '-';

            // total_due
            $returned_amount = DB::table('sales')
                ->join('returns', 'sales.id', '=', 'returns.sale_id')
                ->where([['sales.customer_id', $customer->id], ['sales.payment_status', '!=', 4]])
                ->sum('returns.grand_total');

            $saleData = DB::table('sales')
                ->where([['customer_id', $customer->id], ['payment_status', '!=', 4]])
                ->selectRaw('SUM(grand_total) as grand_total,SUM(paid_amount) as paid_amount')
                ->first();

            $nestedData['total_due'] = number_format($saleData->grand_total - $returned_amount - $saleData->paid_amount, 2) ?? 0;

            $deleteRequest = AccountRemovalRequest::where('user_id', $customer->id)->latest()->first();

select * from `account_removal_requests` where `id` = '1' and `user_id` = '370' limit 1
---
    public function getDestroyRequest(Request $request)
    {
        $validator = Validator::make($request->all(), [
            'removal_id'   => 'required|integer',
            'customer_id'  => 'required|integer',
        ]);

        if ($validator->fails()) {
            return response()->json([
                'message' => 'Validation failed',
                'errors'  => $validator->errors(),
            ], 422);
        }

        try {
            $removal = AccountRemovalRequest::where('id', $request->removal_id)
                ->where('user_id', $request->customer_id)
                ->first();