app/Http/Controllers/HomeController.php

select `purchases`.`id`, `purchases`.`reference_no`, `purchases`.`status`, `purchases`.`created_at`, `purchases`.`grand_total`, `suppliers`.`name` from `purchases` left join `suppliers` on `suppliers`.`id` = `purchases`.`supplier_id` order by `id` desc limit 5
---
    public function recentPurchase()
    {
        if(Auth::user()->role_id > 2 && cache()->get('general_setting')->staff_access == 'own')
        {
            $recent_purchase = Purchase::leftJoin('suppliers', 'suppliers.id', '=', 'purchases.supplier_id')->select('purchases.id','purchases.reference_no','purchases.status','purchases.created_at','purchases.grand_total','purchases.user_id','suppliers.name')->orderBy('id', 'desc')->where('purchases.user_id', Auth::id())->take(5)->get();
            return response()->json($recent_purchase);
        }
        else if(Auth::user()->role_id == 1)
        {
            $recent_purchase = Purchase::leftJoin('suppliers', 'suppliers.id', '=', 'purchases.supplier_id')->select('purchases.id','purchases.reference_no','purchases.status','purchases.created_at','purchases.grand_total','suppliers.name')->orderBy('id', 'desc')->take(5)->get();